; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-21-19)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 - object)
(:init
(at-robby robot1 room12)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room8)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room13)
(at ball2 room8)
(at ball3 room10)
(at ball4 room19)
(at ball5 room5)
(at ball6 room5)
(at ball7 room15)
(at ball8 room8)
(at ball9 room19)
(at ball10 room19)
(at ball11 room19)
(at ball12 room19)
(at ball13 room17)
(at ball14 room7)
(at ball15 room12)
(at ball16 room17)
(at ball17 room12)
(at ball18 room8)
(at ball19 room12)
)
(:goal
(and
(at ball1 room16)
(at ball2 room9)
(at ball3 room8)
(at ball4 room9)
(at ball5 room1)
(at ball6 room2)
(at ball7 room6)
(at ball8 room7)
(at ball9 room14)
(at ball10 room4)
(at ball11 room19)
(at ball12 room21)
(at ball13 room16)
(at ball14 room5)
(at ball15 room10)
(at ball16 room13)
(at ball17 room10)
(at ball18 room15)
(at ball19 room7)
)
)
)

; plan
1. (pick robot2 ball8 room8 lgripper2)
   deleted: (at ball8 room8) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 1 of 19
2. (pick robot2 ball2 room8 rgripper2)
   deleted: (at ball2 room8) (free robot2 rgripper2)
   added: (carry robot2 ball2 rgripper2)
   goals met: 1 of 19
3. (pick robot1 ball19 room12 lgripper1)
   deleted: (at ball19 room12) (free robot1 lgripper1)
   added: (carry robot1 ball19 lgripper1)
   goals met: 1 of 19
4. (pick robot1 ball17 room12 rgripper1)
   deleted: (at ball17 room12) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 1 of 19
5. (move robot2 room8 room9)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room9)
   goals met: 1 of 19
6. (move robot1 room12 room7)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room7)
   goals met: 1 of 19
7. (drop robot2 ball2 room9 rgripper2)
   deleted: (carry robot2 ball2 rgripper2)
   added: (at ball2 room9) (free robot2 rgripper2)
   goals met: 2 of 19
8. (drop robot1 ball19 room7 lgripper1)
   deleted: (carry robot1 ball19 lgripper1)
   added: (at ball19 room7) (free robot1 lgripper1)
   goals met: 3 of 19
9. (move robot2 room9 room7)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room7)
   goals met: 3 of 19
10. (move robot1 room7 room6)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room6)
   goals met: 3 of 19
11. (drop robot2 ball8 room7 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room7) (free robot2 lgripper2)
   goals met: 4 of 19
12. (pick robot2 ball14 room7 rgripper2)
   deleted: (at ball14 room7) (free robot2 rgripper2)
   added: (carry robot2 ball14 rgripper2)
   goals met: 4 of 19
13. (move robot1 room6 room9)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room9)
   goals met: 4 of 19
14. (move robot2 room7 room5)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room5)
   goals met: 4 of 19
15. (move robot1 room9 room4)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room4)
   goals met: 4 of 19
16. (drop robot2 ball14 room5 rgripper2)
   deleted: (carry robot2 ball14 rgripper2)
   added: (at ball14 room5) (free robot2 rgripper2)
   goals met: 5 of 19
17. (pick robot2 ball6 room5 lgripper2)
   deleted: (at ball6 room5) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 5 of 19
18. (move robot1 room4 room10)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room10)
   goals met: 5 of 19
19. (pick robot2 ball5 room5 rgripper2)
   deleted: (at ball5 room5) (free robot2 rgripper2)
   added: (carry robot2 ball5 rgripper2)
   goals met: 5 of 19
20. (drop robot1 ball17 room10 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room10) (free robot1 rgripper1)
   goals met: 6 of 19
21. (pick robot1 ball3 room10 lgripper1)
   deleted: (at ball3 room10) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 6 of 19
22. (move robot2 room5 room2)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room2)
   goals met: 6 of 19
23. (move robot1 room10 room8)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room8)
   goals met: 6 of 19
24. (drop robot2 ball6 room2 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room2) (free robot2 lgripper2)
   goals met: 7 of 19
25. (drop robot1 ball3 room8 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room8) (free robot1 lgripper1)
   goals met: 8 of 19
26. (pick robot1 ball18 room8 rgripper1)
   deleted: (at ball18 room8) (free robot1 rgripper1)
   added: (carry robot1 ball18 rgripper1)
   goals met: 8 of 19
27. (move robot2 room2 room1)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room1)
   goals met: 8 of 19
28. (move robot1 room8 room15)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room15)
   goals met: 8 of 19
29. (drop robot2 ball5 room1 rgripper2)
   deleted: (carry robot2 ball5 rgripper2)
   added: (at ball5 room1) (free robot2 rgripper2)
   goals met: 9 of 19
30. (drop robot1 ball18 room15 rgripper1)
   deleted: (carry robot1 ball18 rgripper1)
   added: (at ball18 room15) (free robot1 rgripper1)
   goals met: 10 of 19
31. (pick robot1 ball7 room15 lgripper1)
   deleted: (at ball7 room15) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 10 of 19
32. (move robot1 room15 room6)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room6)
   goals met: 10 of 19
33. (move robot2 room1 room4)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room4)
   goals met: 10 of 19
34. (drop robot1 ball7 room6 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room6) (free robot1 lgripper1)
   goals met: 11 of 19
35. (move robot2 room4 room9)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room9)
   goals met: 11 of 19
36. (move robot1 room6 room12)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room12)
   goals met: 11 of 19
37. (move robot2 room9 room19)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room19)
   goals met: 11 of 19
38. (pick robot1 ball15 room12 lgripper1)
   deleted: (at ball15 room12) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 11 of 19
39. (pick robot2 ball9 room19 lgripper2)
   deleted: (at ball9 room19) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 11 of 19
40. (pick robot2 ball4 room19 rgripper2)
   deleted: (at ball4 room19) (free robot2 rgripper2)
   added: (carry robot2 ball4 rgripper2)
   goals met: 11 of 19
41. (move robot1 room12 room10)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room10)
   goals met: 11 of 19
42. (move robot2 room19 room9)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room9)
   goals met: 11 of 19
43. (drop robot1 ball15 room10 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room10) (free robot1 lgripper1)
   goals met: 12 of 19
44. (drop robot2 ball4 room9 rgripper2)
   deleted: (carry robot2 ball4 rgripper2)
   added: (at ball4 room9) (free robot2 rgripper2)
   goals met: 13 of 19
45. (move robot2 room9 room14)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room14)
   goals met: 13 of 19
46. (move robot1 room10 room19)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room19)
   goals met: 13 of 19
47. (drop robot2 ball9 room14 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room14) (free robot2 lgripper2)
   goals met: 14 of 19
48. (pick robot1 ball12 room19 lgripper1)
   deleted: (at ball12 room19) (free robot1 lgripper1)
   added: (carry robot1 ball12 lgripper1)
   goals met: 14 of 19
49. (pick robot1 ball10 room19 rgripper1)
   deleted: (at ball10 room19) (free robot1 rgripper1)
   added: (carry robot1 ball10 rgripper1)
   goals met: 14 of 19
50. (move robot1 room19 room4)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room4)
   goals met: 14 of 19
51. (move robot2 room14 room17)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room17)
   goals met: 14 of 19
52. (drop robot1 ball10 room4 rgripper1)
   deleted: (carry robot1 ball10 rgripper1)
   added: (at ball10 room4) (free robot1 rgripper1)
   goals met: 15 of 19
53. (pick robot2 ball16 room17 lgripper2)
   deleted: (at ball16 room17) (free robot2 lgripper2)
   added: (carry robot2 ball16 lgripper2)
   goals met: 15 of 19
54. (pick robot2 ball13 room17 rgripper2)
   deleted: (at ball13 room17) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 15 of 19
55. (move robot2 room17 room16)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room16)
   goals met: 15 of 19
56. (move robot1 room4 room21)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room21)
   goals met: 15 of 19
57. (drop robot1 ball12 room21 lgripper1)
   deleted: (carry robot1 ball12 lgripper1)
   added: (at ball12 room21) (free robot1 lgripper1)
   goals met: 16 of 19
58. (drop robot2 ball13 room16 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room16) (free robot2 rgripper2)
   goals met: 17 of 19
59. (move robot2 room16 room13)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room13)
   goals met: 17 of 19
60. (move robot1 room21 room16)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room16)
   goals met: 17 of 19
61. (drop robot2 ball16 room13 lgripper2)
   deleted: (carry robot2 ball16 lgripper2)
   added: (at ball16 room13) (free robot2 lgripper2)
   goals met: 18 of 19
62. (pick robot2 ball1 room13 rgripper2)
   deleted: (at ball1 room13) (free robot2 rgripper2)
   added: (carry robot2 ball1 rgripper2)
   goals met: 18 of 19
63. (move robot2 room13 room16)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room16)
   goals met: 18 of 19
64. (drop robot2 ball1 room16 rgripper2)
   deleted: (carry robot2 ball1 rgripper2)
   added: (at ball1 room16) (free robot2 rgripper2)
   goals met: 19 of 19
